Ran Plan for project: `homelab-k8s-cluster-room101-a7d-mc` dir: `cluster` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # macaddress.master_net0_mac[0] will be created
+ resource "macaddress" "master_net0_mac" {
      + address = (known after apply)
      + id      = (known after apply)
    }

  # macaddress.master_net0_mac[1] will be created
+ resource "macaddress" "master_net0_mac" {
      + address = (known after apply)
      + id      = (known after apply)
    }

  # macaddress.master_net0_mac[2] will be created
+ resource "macaddress" "master_net0_mac" {
      + address = (known after apply)
      + id      = (known after apply)
    }

  # module.master_instances[0].proxmox_vm_qemu.proxmox_instance will be created
+ resource "proxmox_vm_qemu" "proxmox_instance" {
      + additional_wait           = 0
      + agent                     = 0
      + automatic_reboot          = true
      + balloon                   = 0
      + bios                      = "seabios"
      + boot                      = "order=scsi0;net0"
      + bootdisk                  = (known after apply)
      + clone_wait                = 0
      + cores                     = 2
      + cpu                       = "host"
      + default_ipv4_address      = (known after apply)
      + define_connection_info    = true
      + desc                      = "room101-a7d MC master"
      + force_create              = false
      + full_clone                = true
      + guest_agent_ready_timeout = 100
      + hagroup                   = "ha-group-1"
      + hastate                   = "enabled"
      + hotplug                   = "network,disk,usb"
      + id                        = (known after apply)
      + kvm                       = true
      + memory                    = 3072
      + name                      = "master0-room101-a7d-mc"
      + nameserver                = (known after apply)
      + numa                      = false
      + onboot                    = false
      + oncreate                  = true
      + pool                      = "room101-a7d-mc"
      + preprovision              = true
      + pxe                       = true
      + qemu_os                   = "l26"
      + reboot_required           = (known after apply)
      + scsihw                    = (known after apply)
      + searchdomain              = (known after apply)
      + sockets                   = 1
      + ssh_host                  = (known after apply)
      + ssh_port                  = (known after apply)
      + tablet                    = true
      + target_node               = "host-01"
      + unused_disk               = (known after apply)
      + vcpus                     = 0
      + vlan                      = -1
      + vmid                      = 410

      + disk {
          + backup       = 0
          + cache        = "none"
          + file         = (known after apply)
          + format       = (known after apply)
          + iothread     = 0
          + mbps         = 0
          + mbps_rd      = 0
          + mbps_rd_max  = 0
          + mbps_wr      = 0
          + mbps_wr_max  = 0
          + media        = (known after apply)
          + replicate    = 0
          + size         = "30G"
          + slot         = (known after apply)
          + ssd          = 0
          + storage      = "local-lvm"
          + storage_type = (known after apply)
          + type         = "scsi"
          + volume       = (known after apply)
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
          + queues    = (known after apply)
          + rate      = (known after apply)
          + tag       = 1100
        }
    }

  # module.master_instances[1].proxmox_vm_qemu.proxmox_instance will be created
+ resource "proxmox_vm_qemu" "proxmox_instance" {
      + additional_wait           = 0
      + agent                     = 0
      + automatic_reboot          = true
      + balloon                   = 0
      + bios                      = "seabios"
      + boot                      = "order=scsi0;net0"
      + bootdisk                  = (known after apply)
      + clone_wait                = 0
      + cores                     = 2
      + cpu                       = "host"
      + default_ipv4_address      = (known after apply)
      + define_connection_info    = true
      + desc                      = "room101-a7d MC master"
      + force_create              = false
      + full_clone                = true
      + guest_agent_ready_timeout = 100
      + hagroup                   = "ha-group-2"
      + hastate                   = "enabled"
      + hotplug                   = "network,disk,usb"
      + id                        = (known after apply)
      + kvm                       = true
      + memory                    = 3072
      + name                      = "master1-room101-a7d-mc"
      + nameserver                = (known after apply)
      + numa                      = false
      + onboot                    = false
      + oncreate                  = true
      + pool                      = "room101-a7d-mc"
      + preprovision              = true
      + pxe                       = true
      + qemu_os                   = "l26"
      + reboot_required           = (known after apply)
      + scsihw                    = (known after apply)
      + searchdomain              = (known after apply)
      + sockets                   = 1
      + ssh_host                  = (known after apply)
      + ssh_port                  = (known after apply)
      + tablet                    = true
      + target_node               = "host-02"
      + unused_disk               = (known after apply)
      + vcpus                     = 0
      + vlan                      = -1
      + vmid                      = 411

      + disk {
          + backup       = 0
          + cache        = "none"
          + file         = (known after apply)
          + format       = (known after apply)
          + iothread     = 0
          + mbps         = 0
          + mbps_rd      = 0
          + mbps_rd_max  = 0
          + mbps_wr      = 0
          + mbps_wr_max  = 0
          + media        = (known after apply)
          + replicate    = 0
          + size         = "30G"
          + slot         = (known after apply)
          + ssd          = 0
          + storage      = "local-lvm"
          + storage_type = (known after apply)
          + type         = "scsi"
          + volume       = (known after apply)
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
          + queues    = (known after apply)
          + rate      = (known after apply)
          + tag       = 1100
        }
    }

  # module.master_instances[2].proxmox_vm_qemu.proxmox_instance will be created
+ resource "proxmox_vm_qemu" "proxmox_instance" {
      + additional_wait           = 0
      + agent                     = 0
      + automatic_reboot          = true
      + balloon                   = 0
      + bios                      = "seabios"
      + boot                      = "order=scsi0;net0"
      + bootdisk                  = (known after apply)
      + clone_wait                = 0
      + cores                     = 2
      + cpu                       = "host"
      + default_ipv4_address      = (known after apply)
      + define_connection_info    = true
      + desc                      = "room101-a7d MC master"
      + force_create              = false
      + full_clone                = true
      + guest_agent_ready_timeout = 100
      + hagroup                   = "ha-group-3"
      + hastate                   = "enabled"
      + hotplug                   = "network,disk,usb"
      + id                        = (known after apply)
      + kvm                       = true
      + memory                    = 3072
      + name                      = "master2-room101-a7d-mc"
      + nameserver                = (known after apply)
      + numa                      = false
      + onboot                    = false
      + oncreate                  = true
      + pool                      = "room101-a7d-mc"
      + preprovision              = true
      + pxe                       = true
      + qemu_os                   = "l26"
      + reboot_required           = (known after apply)
      + scsihw                    = (known after apply)
      + searchdomain              = (known after apply)
      + sockets                   = 1
      + ssh_host                  = (known after apply)
      + ssh_port                  = (known after apply)
      + tablet                    = true
      + target_node               = "host-03"
      + unused_disk               = (known after apply)
      + vcpus                     = 0
      + vlan                      = -1
      + vmid                      = 412

      + disk {
          + backup       = 0
          + cache        = "none"
          + file         = (known after apply)
          + format       = (known after apply)
          + iothread     = 0
          + mbps         = 0
          + mbps_rd      = 0
          + mbps_rd_max  = 0
          + mbps_wr      = 0
          + mbps_wr_max  = 0
          + media        = (known after apply)
          + replicate    = 0
          + size         = "30G"
          + slot         = (known after apply)
          + ssd          = 0
          + storage      = "local-lvm"
          + storage_type = (known after apply)
          + type         = "scsi"
          + volume       = (known after apply)
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
          + queues    = (known after apply)
          + rate      = (known after apply)
          + tag       = 1100
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p homelab-k8s-cluster-room101-a7d-mc`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.lab.analbeard.com/lock?id=a7d-corp%252Fhomelab-k8s-cluster-room101-a7d-mc%252Fcluster%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p homelab-k8s-cluster-room101-a7d-mc`
</details>
Plan: 6 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
